Revit 2024 API
BuiltInFailures.ImportFailures.ImportedModelIsEmpty Property
 Imported model is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ImportedModelIsEmpty { get; }
Visual Basic
Public Shared ReadOnly Property ImportedModelIsEmpty As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ImportedModelIsEmpty {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace